In [3]:
"""QTS.1"""
import pandas as pd
l=[4,8,15,16,23,42]
pd.Series(l)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
"""QTS.2"""
a=[1,2,3,4,5,6,7,8,9,10]
pd.Series(a)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [7]:
"""QTS.3"""
d={"Name":["Alice","bob","claire"],
   "Age":[25,30,27],
   "Gender":["Female","Male","Female"]}
pd.DataFrame(d)

     Name  Age  Gender
0   Alice   25  Female
1     bob   30    Male
2  claire   27  Female

In [12]:
"""QTS.4
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.

#difference b/w dataframe and pandas.series:-
a Pandas Series is a 1D array of data,but a single-column DataFrame is a 2D table with one column. 
The main distinction between the two is this. For a single-column DataFrame, 
an index can be optional, but a Series has to have an index defined."""
#series:-
l=[9,8,7]
pd.Series(l)# as abov eseen in qts.2

#dataframe:-as above seen in qts.3
d={"Name":["Alice","bob","claire"],
   "Age":[25,30,27],
   "Gender":["Female","Male","Female"]}
pd.DataFrame(d)

     Name  Age  Gender
0   Alice   25  Female
1     bob   30    Male
2  claire   27  Female

In [20]:
"""QTS.5
1.read_csv() This is one of the most crucial pandas methods in Python. ...
2.head() head(n) is used to return the first n rows of a dataset. ...
3.describe() ...
4.memory_usage() ...
5.astype() ...
6.loc[:] ...
7.to_datetime() ...
8.value_counts()"""
##examples:-
d={"Name":["Alice","bob","claire"],
   "Age":[25,30,27],
   "Gender":["Female","Male","Female"]}
df=pd.DataFrame(d)
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    bob   30    Male

In [21]:
""""QTS.5"""
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [23]:
"""QTS.6
All Pandas data structures are value mutable 
(can be changed) and except Series all are size mutable. Series is size immutable
DataFrame is widely used and one of the most important data structures. Panel is used much less."""

'QTS.6\nAll Pandas data structures are value mutable \n(can be changed) and except Series all are size mutable. Series is size immutable\nDataFrame is widely used and one of the most important data structures. Panel is used much less.'

In [56]:
"""QTS.7"""
l=[4,8,15,16,23,42]
pd.Series(l)
a=[1,2,3,4,5,6]
pd.Series(a)
df=pd.DataFrame(l)
b=[4,5,6,7,8,9]
pd.Series(b)
c=[45,45,85,96,23,56]
pd.Series(c)
#one way to create dataframe with multiple series:-
df['a']=a
df['b']=b
df['c']=c
df

    0  a  b   c
0   4  1  4  45
1   8  2  5  45
2  15  3  6  85
3  16  4  7  96
4  23  5  8  23
5  42  6  9  56

In [73]:
#second way to create dataframe with multiple series:-
l=[0,1,2,3,4,5]
df1=pd.DataFrame((a,b,c))
df1

    0   1   2   3   4   5
0   1   2   3   4   5   6
1   4   5   6   7   8   9
2  45  45  85  96  23  56